const questionsData = [
    {
      id: 1,
      text: "Як швидко ви можете ухвалити рішення в новій, незнайомій ситуації?",
      relatedTraits: ["швидкість мислення", "швидкість прийняття рішень"],
      options: [
        { text: "Зовсім не згоден", value: 0.0 },
        { text: "Скоріше не згоден", value: 0.25 },
        { text: "Важко сказати", value: 0.5 },
        { text: "Скоріше згоден", value: 0.75 },
        { text: "Повністю згоден", value: 1.0 }
      ]
    },
    {
      id: 2,
      text: "Наскільки добре ви запам’ятовуєте деталі того, що бачите?",
      relatedTraits: ["зорова пам'ять"],
      options: [
        { text: "Дуже погано", value: 0.0 },
        { text: "Погано", value: 0.25 },
        { text: "Посередньо", value: 0.5 },
        { text: "Добре", value: 0.75 },
        { text: "Відмінно", value: 1.0 }
      ]
    },
    {
      id: 3,
      text: "Чи легко вам зберігати концентрацію уваги на довготривалих завданнях?",
      relatedTraits: ["концентрація уваги"],
      options: [
        { text: "Зовсім ні", value: 0.0 },
        { text: "Скоріше ні", value: 0.25 },
        { text: "Час від часу", value: 0.5 },
        { text: "Здебільшого так", value: 0.75 },
        { text: "Завжди", value: 1.0 }
      ]
    },
    {
      id: 4,
      text: "Як часто ви залишаєтеся спокійним у стресових ситуаціях?",
      relatedTraits: ["емоційно-вольова стійкість"],
      options: [
        { text: "Ніколи", value: 0.0 },
        { text: "Рідко", value: 0.25 },
        { text: "Іноді", value: 0.5 },
        { text: "Часто", value: 0.75 },
        { text: "Завжди", value: 1.0 }
      ]
    },
    {
      id: 5,
      text: "Як швидко ви реагуєте на несподівані події?",
      relatedTraits: ["швидкість реакції"],
      options: [
        { text: "Дуже повільно", value: 0.0 },
        { text: "Повільно", value: 0.25 },
        { text: "Середньо", value: 0.5 },
        { text: "Швидко", value: 0.75 },
        { text: "Миттєво", value: 1.0 }
      ]
    },
    {
      id: 6,
      text: "Наскільки добре у вас розвинена координація рухів?",
      relatedTraits: ["координація рухів"],
      options: [
        { text: "Дуже погано", value: 0.0 },
        { text: "Погано", value: 0.25 },
        { text: "Посередньо", value: 0.5 },
        { text: "Добре", value: 0.75 },
        { text: "Відмінно", value: 1.0 }
      ]
    },
    {
      id: 7,
      text: "Чи вистачає вам фізичної витривалості для тривалих фізичних або розумових навантажень?",
      relatedTraits: ["фізична витривалість"],
      options: [
        { text: "Зовсім ні", value: 0.0 },
        { text: "Скоріше ні", value: 0.25 },
        { text: "Час від часу", value: 0.5 },
        { text: "Здебільшого так", value: 0.75 },
        { text: "Завжди", value: 1.0 }
      ]
    },
    {
      id: 8,
      text: "Наскільки відповідально ви ставитеся до поставлених завдань?",
      relatedTraits: ["відповідальність"],
      options: [
        { text: "Зовсім не відповідально", value: 0.0 },
        { text: "Погано", value: 0.25 },
        { text: "Посередньо", value: 0.5 },
        { text: "Добре", value: 0.75 },
        { text: "Дуже відповідально", value: 1.0 }
      ]
    },
    {
      id: 9,
      text: "Чи можете ви швидко змінювати план дій при зміні обставин?",
      relatedTraits: ["гнучкість мислення", "емоційно-вольова стійкість"],
      options: [
        { text: "Зовсім ні", value: 0.0 },
        { text: "Рідко", value: 0.25 },
        { text: "Час від часу", value: 0.5 },
        { text: "Часто", value: 0.75 },
        { text: "Завжди", value: 1.0 }
      ]
    },
    {
      id: 10,
      text: "Наскільки швидко ви вивчаєте нові рухи або послідовності дій?",
      relatedTraits: ["рухлива пам'ять"],
      options: [
        { text: "Дуже повільно", value: 0.0 },
        { text: "Повільно", value: 0.25 },
        { text: "Посередньо", value: 0.5 },
        { text: "Швидко", value: 0.75 },
        { text: "Миттєво", value: 1.0 }
      ]
    },
    {
        id: 11,
        text: "Чи важко вам тримати фокус на складних деталях у довгих проектах?",
        relatedTraits: ["концентрація уваги", "відповідальність"],
        options: [
          { text: "Дуже важко", value: 0.0 },
          { text: "Важко", value: 0.25 },
          { text: "Іноді", value: 0.5 },
          { text: "Легко", value: 0.75 },
          { text: "Дуже легко", value: 1.0 }
        ]
      },
      {
        id: 12,
        text: "Як часто ви проявляєте самоконтроль у складних емоційних ситуаціях?",
        relatedTraits: ["емоційно-вольова стійкість"],
        options: [
          { text: "Ніколи", value: 0.0 },
          { text: "Рідко", value: 0.25 },
          { text: "Іноді", value: 0.5 },
          { text: "Часто", value: 0.75 },
          { text: "Завжди", value: 1.0 }
        ]
      },
      {
        id: 13,
        text: "Чи легко вам орієнтуватися у новому фізичному просторі або середовищі?",
        relatedTraits: ["координація рухів"],
        options: [
          { text: "Дуже важко", value: 0.0 },
          { text: "Важко", value: 0.25 },
          { text: "Посередньо", value: 0.5 },
          { text: "Легко", value: 0.75 },
          { text: "Дуже легко", value: 1.0 }
        ]
      },
      {
        id: 14,
        text: "Наскільки добре ви розпізнаєте та запам’ятовуєте обличчя або об’єкти?",
        relatedTraits: ["зорова пам'ять"],
        options: [
          { text: "Дуже погано", value: 0.0 },
          { text: "Погано", value: 0.25 },
          { text: "Посередньо", value: 0.5 },
          { text: "Добре", value: 0.75 },
          { text: "Відмінно", value: 1.0 }
        ]
      },
      {
        id: 15,
        text: "Чи вважаєте ви себе швидким у прийнятті нестандартних рішень?",
        relatedTraits: ["швидкість мислення", "швидкість прийняття рішень"],
        options: [
          { text: "Зовсім ні", value: 0.0 },
          { text: "Скоріше ні", value: 0.25 },
          { text: "Іноді", value: 0.5 },
          { text: "Часто", value: 0.75 },
          { text: "Завжди", value: 1.0 }
        ]
      },
      {
        id: 16,
        text: "Наскільки стійкі ваші фізичні та розумові сили протягом робочого дня?",
        relatedTraits: ["фізична витривалість"],
        options: [
          { text: "Зовсім нестійкі", value: 0.0 },
          { text: "Слабкі", value: 0.25 },
          { text: "Посередні", value: 0.5 },
          { text: "Стійкі", value: 0.75 },
          { text: "Дуже стійкі", value: 1.0 }
        ]
      },
      {
        id: 17,
        text: "Чи вдається вам швидко переходити від одного завдання до іншого без втрати якості?",
        relatedTraits: ["гнучкість мислення"],
        options: [
          { text: "Зовсім ні", value: 0.0 },
          { text: "Рідко", value: 0.25 },
          { text: "Іноді", value: 0.5 },
          { text: "Часто", value: 0.75 },
          { text: "Завжди", value: 1.0 }
        ]
      },
      {
        id: 18,
        text: "Наскільки добре ви пам’ятаєте інструкції або порядок дій після першого ознайомлення?",
        relatedTraits: ["рухлива пам'ять"],
        options: [
          { text: "Зовсім не пам'ятаю", value: 0.0 },
          { text: "Погано", value: 0.25 },
          { text: "Середньо", value: 0.5 },
          { text: "Добре", value: 0.75 },
          { text: "Відмінно", value: 1.0 }
        ]
      },
      {
        id: 19,
        text: "Чи легко вам залишатися зібраним під тиском термінів?",
        relatedTraits: ["емоційно-вольова стійкість", "відповідальність"],
        options: [
          { text: "Зовсім ні", value: 0.0 },
          { text: "Скоріше ні", value: 0.25 },
          { text: "Іноді", value: 0.5 },
          { text: "Часто", value: 0.75 },
          { text: "Завжди", value: 1.0 }
        ]
      },
      {
        id: 20,
        text: "Як швидко ви можете розпізнати закономірності або взаємозв’язки між подіями?",
        relatedTraits: ["швидкість мислення", "концентрація уваги"],
        options: [
          { text: "Дуже повільно", value: 0.0 },
          { text: "Повільно", value: 0.25 },
          { text: "Середньо", value: 0.5 },
          { text: "Швидко", value: 0.75 },
          { text: "Миттєво", value: 1.0 }
        ]
      },
      {
        id: 21,
        text: "Чи відчуваєте ви фізичну втому після інтенсивної розумової праці?",
        relatedTraits: ["фізична витривалість"],
        options: [
          { text: "Завжди", value: 0.0 },
          { text: "Часто", value: 0.25 },
          { text: "Іноді", value: 0.5 },
          { text: "Рідко", value: 0.75 },
          { text: "Ніколи", value: 1.0 }
        ]
      },
      {
        id: 22,
        text: "Як добре ви працюєте в умовах невизначеності або недостатньої інформації?",
        relatedTraits: ["швидкість прийняття рішень", "гнучкість мислення"],
        options: [
          { text: "Дуже погано", value: 0.0 },
          { text: "Погано", value: 0.25 },
          { text: "Посередньо", value: 0.5 },
          { text: "Добре", value: 0.75 },
          { text: "Відмінно", value: 1.0 }
        ]
      },
      {
        id: 23,
        text: "Чи є у вас складнощі у швидкому запам'ятовуванні нових термінів або слів?",
        relatedTraits: ["рухлива пам'ять"],
        options: [
          { text: "Завжди", value: 0.0 },
          { text: "Часто", value: 0.25 },
          { text: "Іноді", value: 0.5 },
          { text: "Рідко", value: 0.75 },
          { text: "Ніколи", value: 1.0 }
        ]
      },
      {
        id: 24,
        text: "Як швидко ви можете прийти до тями після емоційного стресу?",
        relatedTraits: ["емоційно-вольова стійкість"],
        options: [
          { text: "Дуже повільно", value: 0.0 },
          { text: "Повільно", value: 0.25 },
          { text: "Середньо", value: 0.5 },
          { text: "Швидко", value: 0.75 },
          { text: "Миттєво", value: 1.0 }
        ]
      },
      {
        id: 25,
        text: "Чи легко вам зберігати деталізовану інформацію у пам’яті тривалий час?",
        relatedTraits: ["зорова пам'ять"],
        options: [
          { text: "Дуже важко", value: 0.0 },
          { text: "Важко", value: 0.25 },
          { text: "Посередньо", value: 0.5 },
          { text: "Легко", value: 0.75 },
          { text: "Дуже легко", value: 1.0 }
        ]
      }
  ];
  
  export default questionsData;
  