const questionsData = [
  {
    id: 1,
    text: "Як швидко ви можете ухвалити рішення в новій, незнайомій ситуації?",
    weights: {
      military: {
        "швидкість мислення": 1.0,
        "швидкість прийняття рішень": 0.8
      },
      civil: {
        "швидкість мислення": 0.8,
        "швидкість прийняття рішень": 1.0
      }
    },
    options: [
      { text: "Зовсім не згоден", value: 0.0 },
      { text: "Скоріше не згоден", value: 0.25 },
      { text: "Важко сказати", value: 0.5 },
      { text: "Скоріше згоден", value: 0.75 },
      { text: "Повністю згоден", value: 1.0 }
    ]
  },
  {
    id: 2,
    text: "Наскільки добре ви запам’ятовуєте деталі того, що бачите?",
    weights: {
      military: {
        "зорова пам'ять": 1.0,
        "стресостійкість": -0.2
      },
      civil: {
        "зорова пам'ять": 0.8,
        "координація рухів": 0.2
      }
    },
    options: [
      { text: "Дуже погано", value: 0.0 },
      { text: "Погано", value: 0.25 },
      { text: "Посередньо", value: 0.5 },
      { text: "Добре", value: 0.75 },
      { text: "Відмінно", value: 1.0 }
    ]
  },
  {
    id: 3,
    text: "Чи легко вам зберігати концентрацію уваги на довготривалих завданнях?",
    weights: {
      military: {
        "концентрація уваги": 1.0,
        "відповідальність": 0.4
      },
      civil: {
        "концентрація уваги": 1.0,
        "емоційно-вольова стійкість": 0.3
      }
    },
    options: [
      { text: "Зовсім ні", value: 0.0 },
      { text: "Скоріше ні", value: 0.25 },
      { text: "Час від часу", value: 0.5 },
      { text: "Здебільшого так", value: 0.75 },
      { text: "Завжди", value: 1.0 }
    ]
  },
  {
    id: 4,
    text: "Як часто ви залишаєтеся спокійним у стресових ситуаціях?",
    weights: {
      military: {
        "емоційно-вольова стійкість": 1.0,
        "стресостійкість": 0.8
      },
      civil: {
        "емоційно-вольова стійкість": 1.0
      }
    },
    options: [
      { text: "Ніколи", value: 0.0 },
      { text: "Рідко", value: 0.25 },
      { text: "Іноді", value: 0.5 },
      { text: "Часто", value: 0.75 },
      { text: "Завжди", value: 1.0 }
    ]
  },
  {
    id: 5,
    text: "Як швидко ви реагуєте на несподівані події?",
    weights: {
      military: {
        "швидкість реакції": 1.0,
        "координація рухів": 0.5
      },
      civil: {
        "швидкість реакції": 1.0
      }
    },
    options: [
      { text: "Дуже повільно", value: 0.0 },
      { text: "Повільно", value: 0.25 },
      { text: "Середньо", value: 0.5 },
      { text: "Швидко", value: 0.75 },
      { text: "Миттєво", value: 1.0 }
    ]
  },
  {
    id: 6,
    text: "Наскільки добре у вас розвинена координація рухів?",
    weights: {
      military: {
        "координація рухів": 1.0
      },
      civil: {
        "координація рухів": 1.0
      }
    },
    options: [
      { text: "Дуже погано", value: 0.0 },
      { text: "Погано", value: 0.25 },
      { text: "Посередньо", value: 0.5 },
      { text: "Добре", value: 0.75 },
      { text: "Відмінно", value: 1.0 }
    ]
  },
    {
    id: 7,
    text: "Чи вистачає вам фізичної витривалості для тривалих фізичних або розумових навантажень?",
    weights: {
      military: {
        "фізична витривалість": 1.0,
        "емоційно-вольова стійкість": 0.3
      },
      civil: {
        "фізична витривалість": 1.0
      }
    },
    options: [
      { text: "Зовсім ні", value: 0.0 },
      { text: "Скоріше ні", value: 0.25 },
      { text: "Час від часу", value: 0.5 },
      { text: "Здебільшого так", value: 0.75 },
      { text: "Завжди", value: 1.0 }
    ]
  },
  {
    id: 8,
    text: "Наскільки відповідально ви ставитеся до поставлених завдань?",
    weights: {
      military: {
        "відповідальність": 1.0,
        "здатність до підпорядкування": 0.4
      },
      civil: {
        "відповідальність": 1.0
      }
    },
    options: [
      { text: "Зовсім не відповідально", value: 0.0 },
      { text: "Погано", value: 0.25 },
      { text: "Посередньо", value: 0.5 },
      { text: "Добре", value: 0.75 },
      { text: "Дуже відповідально", value: 1.0 }
    ]
  },
  {
    id: 9,
    text: "Чи можете ви швидко змінювати план дій при зміні обставин?",
    weights: {
      military: {
        "гнучкість мислення": 0.8,
        "емоційно-вольова стійкість": 0.6
      },
      civil: {
        "гнучкість мислення": 1.0
      }
    },
    options: [
      { text: "Зовсім ні", value: 0.0 },
      { text: "Рідко", value: 0.25 },
      { text: "Час від часу", value: 0.5 },
      { text: "Часто", value: 0.75 },
      { text: "Завжди", value: 1.0 }
    ]
  },
  {
    id: 10,
    text: "Наскільки швидко ви вивчаєте нові рухи або послідовності дій?",
    weights: {
      military: {
        "рухлива пам'ять": 1.0,
        "координація рухів": 0.5
      },
      civil: {
        "рухлива пам'ять": 1.0
      }
    },
    options: [
      { text: "Дуже повільно", value: 0.0 },
      { text: "Повільно", value: 0.25 },
      { text: "Посередньо", value: 0.5 },
      { text: "Швидко", value: 0.75 },
      { text: "Миттєво", value: 1.0 }
    ]
  },
  {
    id: 11,
    text: "Чи важко вам тримати фокус на складних деталях у довгих проектах?",
    weights: {
      military: {
        "концентрація уваги": 1.0,
        "відповідальність": 0.6
      },
      civil: {
        "концентрація уваги": 1.0,
        "відповідальність": 0.8
      }
    },
    options: [
      { text: "Дуже важко", value: 0.0 },
      { text: "Важко", value: 0.25 },
      { text: "Іноді", value: 0.5 },
      { text: "Легко", value: 0.75 },
      { text: "Дуже легко", value: 1.0 }
    ]
  },
  {
    id: 12,
    text: "Як часто ви проявляєте самоконтроль у складних емоційних ситуаціях?",
    weights: {
      military: {
        "емоційно-вольова стійкість": 1.0
      },
      civil: {
        "емоційно-вольова стійкість": 1.0
      }
    },
    options: [
      { text: "Ніколи", value: 0.0 },
      { text: "Рідко", value: 0.25 },
      { text: "Іноді", value: 0.5 },
      { text: "Часто", value: 0.75 },
      { text: "Завжди", value: 1.0 }
    ]
  },
  {
    id: 13,
    text: "Чи легко вам орієнтуватися у новому фізичному просторі або середовищі?",
    weights: {
      military: {
        "координація рухів": 0.6,
        "просторове мислення": 1.0
      },
      civil: {
        "координація рухів": 0.8
      }
    },
    options: [
      { text: "Дуже важко", value: 0.0 },
      { text: "Важко", value: 0.25 },
      { text: "Посередньо", value: 0.5 },
      { text: "Легко", value: 0.75 },
      { text: "Дуже легко", value: 1.0 }
    ]
  },
  {
    id: 14,
    text: "Наскільки добре ви розпізнаєте та запам’ятовуєте обличчя або об’єкти?",
    weights: {
      military: {
        "зорова пам'ять": 1.0
      },
      civil: {
        "зорова пам'ять": 1.0
      }
    },
    options: [
      { text: "Дуже погано", value: 0.0 },
      { text: "Погано", value: 0.25 },
      { text: "Посередньо", value: 0.5 },
      { text: "Добре", value: 0.75 },
      { text: "Відмінно", value: 1.0 }
    ]
  },
  {
    id: 15,
    text: "Чи вважаєте ви себе швидким у прийнятті нестандартних рішень?",
    weights: {
      military: {
        "швидкість мислення": 1.0,
        "швидкість прийняття рішень": 1.0
      },
      civil: {
        "швидкість мислення": 1.0
      }
    },
    options: [
      { text: "Зовсім ні", value: 0.0 },
      { text: "Скоріше ні", value: 0.25 },
      { text: "Іноді", value: 0.5 },
      { text: "Часто", value: 0.75 },
      { text: "Завжди", value: 1.0 }
    ]
  },
  {
    id: 16,
    text: "Наскільки стійкі ваші фізичні та розумові сили протягом робочого дня?",
    weights: {
      military: {
        "фізична витривалість": 1.0,
        "емоційно-вольова стійкість": 0.5
      },
      civil: {
        "фізична витривалість": 1.0
      }
    },
    options: [
      { text: "Зовсім нестійкі", value: 0.0 },
      { text: "Слабкі", value: 0.25 },
      { text: "Посередні", value: 0.5 },
      { text: "Стійкі", value: 0.75 },
      { text: "Дуже стійкі", value: 1.0 }
    ]
  },
  {
    id: 17,
    text: "Чи вдається вам швидко переходити від одного завдання до іншого без втрати якості?",
    weights: {
      military: {
        "гнучкість мислення": 1.0,
        "концентрація уваги": 0.5
      },
      civil: {
        "гнучкість мислення": 1.0
      }
    },
    options: [
      { text: "Зовсім ні", value: 0.0 },
      { text: "Рідко", value: 0.25 },
      { text: "Іноді", value: 0.5 },
      { text: "Часто", value: 0.75 },
      { text: "Завжди", value: 1.0 }
    ]
  },
  {
    id: 18,
    text: "Наскільки добре ви пам’ятаєте інструкції або порядок дій після першого ознайомлення?",
    weights: {
      military: {
        "рухлива пам'ять": 1.0,
        "відповідальність": 0.5
      },
      civil: {
        "рухлива пам'ять": 1.0
      }
    },
    options: [
      { text: "Зовсім не пам'ятаю", value: 0.0 },
      { text: "Погано", value: 0.25 },
      { text: "Середньо", value: 0.5 },
      { text: "Добре", value: 0.75 },
      { text: "Відмінно", value: 1.0 }
    ]
  },
  {
    id: 19,
    text: "Чи легко вам залишатися зібраним під тиском термінів?",
    weights: {
      military: {
        "емоційно-вольова стійкість": 1.0,
        "відповідальність": 0.8
      },
      civil: {
        "емоційно-вольова стійкість": 0.9,
        "відповідальність": 0.6
      }
    },
    options: [
      { text: "Зовсім ні", value: 0.0 },
      { text: "Скоріше ні", value: 0.25 },
      { text: "Іноді", value: 0.5 },
      { text: "Часто", value: 0.75 },
      { text: "Завжди", value: 1.0 }
    ]
  },
  {
    id: 20,
    text: "Як швидко ви можете розпізнати закономірності або взаємозв’язки між подіями?",
    weights: {
      military: {
        "швидкість мислення": 1.0,
        "концентрація уваги": 0.5
      },
      civil: {
        "швидкість мислення": 1.0,
        "концентрація уваги": 0.8
      }
    },
    options: [
      { text: "Дуже повільно", value: 0.0 },
      { text: "Повільно", value: 0.25 },
      { text: "Середньо", value: 0.5 },
      { text: "Швидко", value: 0.75 },
      { text: "Миттєво", value: 1.0 }
    ]
  },
  {
    id: 21,
    text: "Чи відчуваєте ви фізичну втому після інтенсивної розумової праці?",
    weights: {
      military: {
        "фізична витривалість": -1.0
      },
      civil: {
        "фізична витривалість": -1.0
      }
    },
    options: [
      { text: "Завжди", value: 0.0 },
      { text: "Часто", value: 0.25 },
      { text: "Іноді", value: 0.5 },
      { text: "Рідко", value: 0.75 },
      { text: "Ніколи", value: 1.0 }
    ]
  },
  {
    id: 22,
    text: "Як добре ви працюєте в умовах невизначеності або недостатньої інформації?",
    weights: {
      military: {
        "швидкість прийняття рішень": 1.0,
        "гнучкість мислення": 0.6
      },
      civil: {
        "гнучкість мислення": 1.0
      }
    },
    options: [
      { text: "Дуже погано", value: 0.0 },
      { text: "Погано", value: 0.25 },
      { text: "Посередньо", value: 0.5 },
      { text: "Добре", value: 0.75 },
      { text: "Відмінно", value: 1.0 }
    ]
  },
  {
    id: 23,
    text: "Чи є у вас складнощі у швидкому запам'ятовуванні нових термінів або слів?",
    weights: {
      military: {
        "рухлива пам'ять": -1.0
      },
      civil: {
        "рухлива пам'ять": -1.0
      }
    },
    options: [
      { text: "Завжди", value: 0.0 },
      { text: "Часто", value: 0.25 },
      { text: "Іноді", value: 0.5 },
      { text: "Рідко", value: 0.75 },
      { text: "Ніколи", value: 1.0 }
    ]
  },
  {
    id: 24,
    text: "Як швидко ви можете прийти до тями після емоційного стресу?",
    weights: {
      military: {
        "емоційно-вольова стійкість": 1.0,
        "стресостійкість": 0.7
      },
      civil: {
        "емоційно-вольова стійкість": 1.0
      }
    },
    options: [
      { text: "Дуже повільно", value: 0.0 },
      { text: "Повільно", value: 0.25 },
      { text: "Середньо", value: 0.5 },
      { text: "Швидко", value: 0.75 },
      { text: "Миттєво", value: 1.0 }
    ]
  },
  {
    id: 25,
    text: "Чи легко вам зберігати деталізовану інформацію у пам’яті тривалий час?",
    weights: {
      military: {
        "зорова пам'ять": 1.0
      },
      civil: {
        "зорова пам'ять": 1.0
      }
    },
    options: [
      { text: "Дуже важко", value: 0.0 },
      { text: "Важко", value: 0.25 },
      { text: "Посередньо", value: 0.5 },
      { text: "Легко", value: 0.75 },
      { text: "Дуже легко", value: 1.0 }
    ]
  }
];


export const professionRequirements = {
  military: {
    "Штурмовик": {
      "швидкість мислення": 0.9,
      "швидкість прийняття рішень": 0.8,
      "зорова пам'ять": 0.6,
      "концентрація уваги": 0.7,
      "емоційно-вольова стійкість": 0.8,
      "швидкість реакції": 0.85,
      "координація рухів": 1.0,
      "фізична витривалість": 0.9,
      "відповідальність": 0.7,
      "гнучкість мислення": 0.6,
      "рухлива пам'ять": 0.5,
      "комунікабельність": 0.4,
      "стресостійкість": 0.7,
      "здатність до підпорядкування": 0.9,
      "просторове мислення": 0.5
    },
    "Снайпер": {
      "швидкість мислення": 0.8,
      "швидкість прийняття рішень": 0.6,
      "зорова пам'ять": 1.0,
      "концентрація уваги": 1.0,
      "емоційно-вольова стійкість": 0.85,
      "швидкість реакції": 0.9,
      "координація рухів": 0.9,
      "фізична витривалість": 0.75,
      "відповідальність": 0.8,
      "гнучкість мислення": 0.6,
      "рухлива пам'ять": 0.6,
      "комунікабельність": 0.3,
      "стресостійкість": 0.9,
      "здатність до підпорядкування": 0.8,
      "просторове мислення": 0.8
    },
    "Розвідник": {
      "швидкість мислення": 0.85,
      "швидкість прийняття рішень": 0.7,
      "зорова пам'ять": 0.7,
      "концентрація уваги": 0.8,
      "емоційно-вольова стійкість": 0.9,
      "швидкість реакції": 0.8,
      "координація рухів": 0.85,
      "фізична витривалість": 0.8,
      "відповідальність": 0.75,
      "гнучкість мислення": 0.7,
      "рухлива пам'ять": 0.8,
      "комунікабельність": 0.5,
      "стресостійкість": 0.8,
      "здатність до підпорядкування": 0.7,
      "просторове мислення": 1.0
    },
    "Оператор БПЛА": {
      "швидкість мислення": 0.8,
      "швидкість прийняття рішень": 0.7,
      "зорова пам'ять": 0.9,
      "концентрація уваги": 0.9,
      "емоційно-вольова стійкість": 0.8,
      "швидкість реакції": 0.7,
      "координація рухів": 0.6,
      "фізична витривалість": 0.6,
      "відповідальність": 0.8,
      "гнучкість мислення": 0.75,
      "рухлива пам'ять": 0.7,
      "комунікабельність": 0.6,
      "стресостійкість": 0.7,
      "здатність до підпорядкування": 0.7,
      "просторове мислення": 0.85
    }
  },
  civil: {
    "Програміст": {
      "швидкість мислення": 0.9,
      "швидкість прийняття рішень": 0.8,
      "зорова пам'ять": 0.6,
      "концентрація уваги": 0.85,
      "емоційно-вольова стійкість": 0.7,
      "швидкість реакції": 0.5,
      "координація рухів": 0.5,
      "фізична витривалість": 0.6,
      "відповідальність": 0.9,
      "гнучкість мислення": 0.9,
      "рухлива пам'ять": 0.7,
      "комунікабельність": 0.4
    },
    "Психолог": {
      "швидкість мислення": 0.7,
      "швидкість прийняття рішень": 0.6,
      "зорова пам'ять": 0.7,
      "концентрація уваги": 0.8,
      "емоційно-вольова стійкість": 0.9,
      "швидкість реакції": 0.5,
      "координація рухів": 0.5,
      "фізична витривалість": 0.5,
      "відповідальність": 0.75,
      "гнучкість мислення": 0.7,
      "рухлива пам'ять": 0.6,
      "комунікабельність": 1.0
    },
    "Логіст": {
      "швидкість мислення": 0.8,
      "швидкість прийняття рішень": 0.8,
      "зорова пам'ять": 0.7,
      "концентрація уваги": 0.7,
      "емоційно-вольова стійкість": 0.7,
      "швидкість реакції": 0.6,
      "координація рухів": 0.6,
      "фізична витривалість": 0.6,
      "відповідальність": 0.9,
      "гнучкість мислення": 0.7,
      "рухлива пам'ять": 0.6,
      "комунікабельність": 0.6
    },
    "Медсестра": {
      "швидкість мислення": 0.6,
      "швидкість прийняття рішень": 0.7,
      "зорова пам'ять": 0.6,
      "концентрація уваги": 0.75,
      "емоційно-вольова стійкість": 0.9,
      "швидкість реакції": 0.8,
      "координація рухів": 0.7,
      "фізична витривалість": 0.8,
      "відповідальність": 0.85,
      "гнучкість мислення": 0.65,
      "рухлива пам'ять": 0.7,
      "комунікабельність": 0.8
    }
  }
};

export default questionsData;
